# Juntar y concatenar dataframes

In [8]:
import pandas as pd
df_movies = pd.read_csv('IMDb movies.csv',low_memory=False)
df_ratings = pd.read_csv('IMDb ratings.csv')

In [9]:
df_movies.columns

Index(['imdb_title_id', 'title', 'original_title', 'year', 'date_published',
       'genre', 'duration', 'country', 'language', 'director', 'writer',
       'production_company', 'actors', 'description', 'avg_vote', 'votes',
       'budget', 'usa_gross_income', 'worlwide_gross_income', 'metascore',
       'reviews_from_users', 'reviews_from_critics'],
      dtype='object')

In [10]:
df_movies = df_movies[['imdb_title_id','title','year','genre','country']]

In [11]:
df_movies

,imdb_title_id,title,year,genre,country
0,tt0000009,Miss Jerry,1894,Romance,USA
1,tt0000574,The Story of the Kelly Gang,1906,"Biography, Crime, Drama",Australia
2,tt0001892,Den sorte drøm,1911,Drama,"Germany, Denmark"
3,tt0002101,Cleopatra,1912,"Drama, History",USA
4,tt0002130,L'Inferno,1911,"Adventure, Drama, Fantasy",Italy
...,...,...,...,...,...
85850,tt9908390,Le lion,2020,Comedy,"France, Belgium"
85851,tt9911196,De Beentjes van Sint-Hildegard,2020,"Comedy, Drama",Netherlands
85852,tt9911774,Padmavyuhathile Abhimanyu,2019,Drama,India
85853,tt9914286,Sokagin Çocuklari,2019,"Drama, Family",Turkey
85854,tt9914942,La vida sense la Sara Amat,2019,Drama,Spain

In [12]:
df_ratings.columns

Index(['imdb_title_id', 'weighted_average_vote', 'total_votes', 'mean_vote',
       'median_vote', 'votes_10', 'votes_9', 'votes_8', 'votes_7', 'votes_6',
       'votes_5', 'votes_4', 'votes_3', 'votes_2', 'votes_1',
       'allgenders_0age_avg_vote', 'allgenders_0age_votes',
       'allgenders_18age_avg_vote', 'allgenders_18age_votes',
       'allgenders_30age_avg_vote', 'allgenders_30age_votes',
       'allgenders_45age_avg_vote', 'allgenders_45age_votes',
       'males_allages_avg_vote', 'males_allages_votes', 'males_0age_avg_vote',
       'males_0age_votes', 'males_18age_avg_vote', 'males_18age_votes',
       'males_30age_avg_vote', 'males_30age_votes', 'males_45age_avg_vote',
       'males_45age_votes', 'females_allages_avg_vote',
       'females_allages_votes', 'females_0age_avg_vote', 'females_0age_votes',
       'females_18age_avg_vote', 'females_18age_votes',
       'females_30age_avg_vote', 'females_30age_votes',
       'females_45age_avg_vote', 'females_45age_votes',
       'top1000_voters_rating', 'top1000_voters_votes', 'us_voters_rating',
       'us_voters_votes', 'non_us_voters_rating', 'non_us_voters_votes'],
      dtype='object')

In [15]:
 df_ratings = df_ratings[['imdb_title_id','total_votes','mean_vote']]

In [16]:
df_movies
df_ratings

      imdb_title_id  total_votes  mean_vote
0         tt0000009          154        5.9
1         tt0000574          589        6.3
2         tt0001892          188        6.0
3         tt0002101          446        5.3
4         tt0002130         2237        6.9
...             ...          ...        ...
85850     tt9908390          398        5.5
85851     tt9911196          724        7.9
85852     tt9911774          265        7.8
85853     tt9914286          194        9.4
85854     tt9914942          102        6.8

[85855 rows x 3 columns]

## concat()

#### concatenacion vertical

In [17]:
df1 = pd.DataFrame({'id':['A','B','C','D'],'age':[30,23,25,22]})
df2 = pd.DataFrame({'id':['E','F','G','F'],'age':[40,21,19,24]})

In [18]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [19]:
df2

  id  age
0  E   40
1  F   21
2  G   19
3  F   24

In [24]:
# concatenemos sin index repetidos y ordenado
pd.concat([df1,df2],axis=0,ignore_index=True, sort=True)

   age id
0   30  A
1   23  B
2   25  C
3   22  D
4   40  E
5   21  F
6   19  G
7   24  F

##  Ejercicio

In [32]:
# extraer 50% de muestra del dataframe original 
df_samples = df_movies.sample(frac=0.5)

In [35]:
# shape
print(df_movies.shape)
print(df_samples.shape)

(85855, 5)
(42928, 5)

In [36]:
# concatenar verticalmente df_movies y df_samples
df_concat_vertical = pd.concat([df_samples,df_movies],axis=0,ignore_index=True, sort=True)

In [37]:
df_concat_vertical.shape

(128783, 5)

# concat()

#### concatenar horizontalmente

In [40]:
df1 = pd.DataFrame({'id':['A','B','C','D'],'age':[30,23,25,22]})
df2 = pd.DataFrame({'job':['Doctor','Statistician',
                            'Accountant','Developper']})

In [41]:
df1

  id  age
0  A   30
1  B   23
2  C   25
3  D   22

In [42]:
df2

            job
0        Doctor
1  Statistician
2    Accountant
3    Developper

In [43]:
pd.concat([df1,df2],axis=1)

  id  age           job
0  A   30        Doctor
1  B   23  Statistician
2  C   25    Accountant
3  D   22    Developper